results/raw/k3_bench_v1_d256_c512.txt
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30010, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=2, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:30010/v1/models to become ready...
Server ready in 0.0s.

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30010, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/models/Kimi-K3', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=1024, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, flush_cache_timeout=60.0, warmup_requests=2, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
#Input tokens: 8192
#Output tokens: 32768
Starting warmup with 2 sequences...
Warmup completed with 2 sequences. Starting main benchmark run...
100%|██████████| 32/32 [00:45<00:00,  1.43s/it]
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
Calling super().encode with {'add_special_tokens': False}
[...]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  45.92     
Total input tokens:                      8192      
Total input text tokens:                 8192      
Total generated tokens:                  32768     
Total generated tokens (retokenized):    32762     
Request throughput (req/s):              0.70      
Input token throughput (tok/s):          178.40    
Output token throughput (tok/s):         713.58    
Peak output token throughput (tok/s):    832.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          891.98    
Concurrency:                             31.97     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   45878.36  
Median E2E Latency (ms):                 45878.40  
P90 E2E Latency (ms):                    45879.13  
P95 E2E Latency (ms):                    45879.74  
P99 E2E Latency (ms):                    45880.04  
---------------Time to First Token----------------
Mean TTFT (ms):                          3358.49   
Median TTFT (ms):                        3363.22   
P90 TTFT (ms):                           5344.26   
P95 TTFT (ms):                           5690.25   
P99 TTFT (ms):                           5699.67   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          41.56     
Median TPOT (ms):                        41.56     
P90 TPOT (ms):                           43.49     
P95 TPOT (ms):                           43.82     
P99 TPOT (ms):                           44.04     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           41.56     
Median ITL (ms):                         39.24     
P90 ITL (ms):                            39.62     
P95 ITL (ms):                            39.77     
P99 ITL (ms):                            40.02     
Max ITL (ms):                            5013.25   
==================================================